In [17]:
import pandas as pd
import numpy as np

In [18]:
s=pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [19]:
for i in s:
    print(i)

1
2
3
4

In [20]:
a=[90,95,98]

s=pd.Series(a,index=["Sayandeep","Tanmay","Riban"])

s

Sayandeep    90
Tanmay       95
Riban        98
dtype: int64

In [21]:
data={"time1":100,"time2":200,"time3":300}

In [22]:
df=pd.Series(data)
df

time1    100
time2    200
time3    300
dtype: int64

In [23]:
data={
    "Name":["Sayandeep","Tanmay","Riban"],
    "Age":[22,22,22],
    "Roll":[69,72,66]
}

In [24]:
df=pd.DataFrame(data)

In [25]:
df

        Name  Age  Roll
0  Sayandeep   22    69
1     Tanmay   22    72
2      Riban   22    66

In [30]:
df.loc[1]

Name    Tanmay
Age         22
Roll        72
Name: 1, dtype: object

In [38]:
df.shape

(3, 3)

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Roll    3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes

In [40]:
df.describe()

        Age  Roll
count   3.0   3.0
mean   22.0  69.0
std     0.0   3.0
min    22.0  66.0
25%    22.0  67.5
50%    22.0  69.0
75%    22.0  70.5
max    22.0  72.0

In [41]:
df

        Name  Age  Roll
0  Sayandeep   22    69
1     Tanmay   22    72
2      Riban   22    66

In [42]:
df.loc[0]

Name    Sayandeep
Age            22
Roll           69
Name: 0, dtype: object

In [43]:
df.loc[[0,1]]

        Name  Age  Roll
0  Sayandeep   22    69
1     Tanmay   22    72

In [44]:
df.iloc[0]

Name    Sayandeep
Age            22
Roll           69
Name: 0, dtype: object

In [45]:
df.iloc[[0,2]]

        Name  Age  Roll
0  Sayandeep   22    69
2      Riban   22    66

In [49]:
df=pd.read_csv('test2.csv')
df

        Name   age  Experience   Salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7        NaN  34.0        10.0  38000.0
8        NaN  36.0         NaN      NaN

In [51]:
df.rename(

    columns={
        
        "Name":"name",
        "Experience":"experience",
        "Salary":"salary"
    },
    
    inplace=True

)

In [52]:
df

        name   age  experience   salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0
3       Paul  24.0         3.0  20000.0
4     Harsha  21.0         1.0  15000.0
5    Shubham  23.0         2.0  18000.0
6     Mahesh   NaN         NaN  40000.0
7        NaN  34.0        10.0  38000.0
8        NaN  36.0         NaN      NaN

In [53]:
df['age after 2 years']=df['age']+2
df

        name   age  experience   salary  age after 2 years
0      Krish  31.0        10.0  30000.0               33.0
1  Sudhanshu  30.0         8.0  25000.0               32.0
2      Sunny  29.0         4.0  20000.0               31.0
3       Paul  24.0         3.0  20000.0               26.0
4     Harsha  21.0         1.0  15000.0               23.0
5    Shubham  23.0         2.0  18000.0               25.0
6     Mahesh   NaN         NaN  40000.0                NaN
7        NaN  34.0        10.0  38000.0               36.0
8        NaN  36.0         NaN      NaN               38.0

In [56]:
df.loc[0]

name                   Krish
age                     31.0
experience              10.0
salary               30000.0
age after 2 years       33.0
Name: 0, dtype: object

In [57]:
df.loc[1]

name                 Sudhanshu
age                       30.0
experience                 8.0
salary                 25000.0
age after 2 years         32.0
Name: 1, dtype: object

In [68]:
df.loc[0,"name"]

'Krish'

In [59]:
df.loc[[0,1,2]]

        name   age  experience   salary  age after 2 years
0      Krish  31.0        10.0  30000.0               33.0
1  Sudhanshu  30.0         8.0  25000.0               32.0
2      Sunny  29.0         4.0  20000.0               31.0

In [63]:
df.loc[[0,1],["name","age"]]

        name   age
0      Krish  31.0
1  Sudhanshu  30.0

In [74]:
df.loc[0:3,["name","salary"]]

        name   salary
0      Krish  30000.0
1  Sudhanshu  25000.0
2      Sunny  20000.0
3       Paul  20000.0

In [64]:
df.iloc[0]

name                   Krish
age                     31.0
experience              10.0
salary               30000.0
age after 2 years       33.0
Name: 0, dtype: object

In [69]:
df.iloc[0,1]

31.0

In [70]:
df.iloc[[0,1]]

        name   age  experience   salary  age after 2 years
0      Krish  31.0        10.0  30000.0               33.0
1  Sudhanshu  30.0         8.0  25000.0               32.0

In [72]:
df.iloc[0:3,0:4]

        name   age  experience   salary
0      Krish  31.0        10.0  30000.0
1  Sudhanshu  30.0         8.0  25000.0
2      Sunny  29.0         4.0  20000.0

In [75]:
df

        name   age  experience   salary  age after 2 years
0      Krish  31.0        10.0  30000.0               33.0
1  Sudhanshu  30.0         8.0  25000.0               32.0
2      Sunny  29.0         4.0  20000.0               31.0
3       Paul  24.0         3.0  20000.0               26.0
4     Harsha  21.0         1.0  15000.0               23.0
5    Shubham  23.0         2.0  18000.0               25.0
6     Mahesh   NaN         NaN  40000.0                NaN
7        NaN  34.0        10.0  38000.0               36.0
8        NaN  36.0         NaN      NaN               38.0

In [77]:
df_new=df.drop(columns=["salary","age after 2 years"])
df_new

        name   age  experience
0      Krish  31.0        10.0
1  Sudhanshu  30.0         8.0
2      Sunny  29.0         4.0
3       Paul  24.0         3.0
4     Harsha  21.0         1.0
5    Shubham  23.0         2.0
6     Mahesh   NaN         NaN
7        NaN  34.0        10.0
8        NaN  36.0         NaN

In [80]:
df_new=df.loc[:,df.columns!='salary']
df_new

        name   age  experience  age after 2 years
0      Krish  31.0        10.0               33.0
1  Sudhanshu  30.0         8.0               32.0
2      Sunny  29.0         4.0               31.0
3       Paul  24.0         3.0               26.0
4     Harsha  21.0         1.0               23.0
5    Shubham  23.0         2.0               25.0
6     Mahesh   NaN         NaN                NaN
7        NaN  34.0        10.0               36.0
8        NaN  36.0         NaN               38.0

In [82]:
df

        name   age  experience   salary  age after 2 years
0      Krish  31.0        10.0  30000.0               33.0
1  Sudhanshu  30.0         8.0  25000.0               32.0
2      Sunny  29.0         4.0  20000.0               31.0
3       Paul  24.0         3.0  20000.0               26.0
4     Harsha  21.0         1.0  15000.0               23.0
5    Shubham  23.0         2.0  18000.0               25.0
6     Mahesh   NaN         NaN  40000.0                NaN
7        NaN  34.0        10.0  38000.0               36.0
8        NaN  36.0         NaN      NaN               38.0

In [83]:
df['experience after 2 years']=df['experience'].apply(lambda x:x+2)
df

,name,age,experience,salary,age after 2 years,experience after 2 years
0,Krish,31.0,10.0,30000.0,33.0,12.0
1,Sudhanshu,30.0,8.0,25000.0,32.0,10.0
2,Sunny,29.0,4.0,20000.0,31.0,6.0
3,Paul,24.0,3.0,20000.0,26.0,5.0
4,Harsha,21.0,1.0,15000.0,23.0,3.0
5,Shubham,23.0,2.0,18000.0,25.0,4.0
6,Mahesh,NaN,NaN,40000.0,NaN,NaN
7,NaN,34.0,10.0,38000.0,36.0,12.0
8,NaN,36.0,NaN,NaN,38.0,NaN

In [84]:
def myfunc(exp):
    if exp<=4:
        return "beginner"
    elif exp>4 and exp<=8:
        return "avg"
    else:
        return "expert"

df['level']=df['experience'].map(myfunc)

In [85]:
df

,name,age,experience,salary,age after 2 years,experience after 2 years,level
0,Krish,31.0,10.0,30000.0,33.0,12.0,expert
1,Sudhanshu,30.0,8.0,25000.0,32.0,10.0,avg
2,Sunny,29.0,4.0,20000.0,31.0,6.0,beginner
3,Paul,24.0,3.0,20000.0,26.0,5.0,beginner
4,Harsha,21.0,1.0,15000.0,23.0,3.0,beginner
5,Shubham,23.0,2.0,18000.0,25.0,4.0,beginner
6,Mahesh,NaN,NaN,40000.0,NaN,NaN,expert
7,NaN,34.0,10.0,38000.0,36.0,12.0,expert
8,NaN,36.0,NaN,NaN,38.0,NaN,expert

In [87]:
df=df.sort_values(by='age',ascending=True)
df

,name,age,experience,salary,age after 2 years,experience after 2 years,level
4,Harsha,21.0,1.0,15000.0,23.0,3.0,beginner
5,Shubham,23.0,2.0,18000.0,25.0,4.0,beginner
3,Paul,24.0,3.0,20000.0,26.0,5.0,beginner
2,Sunny,29.0,4.0,20000.0,31.0,6.0,beginner
1,Sudhanshu,30.0,8.0,25000.0,32.0,10.0,avg
0,Krish,31.0,10.0,30000.0,33.0,12.0,expert
7,NaN,34.0,10.0,38000.0,36.0,12.0,expert
8,NaN,36.0,NaN,NaN,38.0,NaN,expert
6,Mahesh,NaN,NaN,40000.0,NaN,NaN,expert

In [88]:
df.groupby('level').sum()

,name,age,experience,salary,age after 2 years,experience after 2 years
level,,,,,,
avg,Sudhanshu,30.0,8.0,25000.0,32.0,10.0
beginner,HarshaShubhamPaulSunny,97.0,10.0,73000.0,105.0,18.0
expert,KrishMahesh,101.0,20.0,108000.0,107.0,24.0

In [89]:
df=pd.read_excel('Midea Shortlist.xlsx')
df.head()

                  NAME                      EMAIL ID DEPARTMENT
0          Sumit Gupta           sg9471465@gmail.com        EIE
1  Rohondeep Mukherjee  rohandeepmukherjee@gmail.com        EIE
2      ABHINABA SARKAR  abhinabasarkar2002@gmail.com        EIE
3        Raunit Mondal        mondalraunit@gmail.com        EIE
4          Md Abu Toha       mdabutoha2002@gmail.com        EIE

In [90]:
df.tail()

              NAME                      EMAIL ID  DEPARTMENT
77      Harsh Shaw  harshshaw.personal@gmail.com  PRODUCTION
78  Bitasta Sarkar         bitasta2003@gmail.com  PRODUCTION
79  Sk Sahil Ahmed      sahilahamedsk5@gmail.com  PRODUCTION
80   Sayan Acharya        say10acharya@gmail.com  PRODUCTION
81   Souvik Sardar         sc031sardar@gmail.com  PRODUCTION

In [96]:
df.groupby('DEPARTMENT').count()

                    NAME  EMAIL ID
DEPARTMENT
EIE                   10        10
ELECTRICAL            23        23
ELECTRICAL (POWER)     6         6
ETCE                  14        14
MECHANICAL            16        16
METALLURGY             5         5
PRODUCTION             8         8

In [97]:
df.groupby('DEPARTMENT').count()["NAME"]

DEPARTMENT
EIE                   10
ELECTRICAL            23
ELECTRICAL (POWER)     6
ETCE                  14
MECHANICAL            16
METALLURGY             5
PRODUCTION             8
Name: NAME, dtype: int64

In [100]:
df_new=df.sort_values(by='DEPARTMENT',ascending=False)
df_new

               NAME                           EMAIL ID  DEPARTMENT
81    Souvik Sardar              sc031sardar@gmail.com  PRODUCTION
80    Sayan Acharya             say10acharya@gmail.com  PRODUCTION
79   Sk Sahil Ahmed           sahilahamedsk5@gmail.com  PRODUCTION
78   Bitasta Sarkar              bitasta2003@gmail.com  PRODUCTION
77       Harsh Shaw       harshshaw.personal@gmail.com  PRODUCTION
..              ...                                ...         ...
6    Ambarish Kundu             ambarishk497@gmail.com         EIE
7     SAYANTA DUTTA          sayanta17042002@gmail.com         EIE
8       RISHAV bose            rishavbose101@gmail.com         EIE
9   Jagannath Singh  jagannathsinghsardar150@gmail.com         EIE
0       Sumit Gupta                sg9471465@gmail.com         EIE

[82 rows x 3 columns]

In [106]:
result=df[df["NAME"]=="SAYANTA DUTTA"]
result

            NAME                   EMAIL ID DEPARTMENT
7  SAYANTA DUTTA  sayanta17042002@gmail.com        EIE

In [107]:
names_to_find=["SAYANTA DUTTA","Harsh Shaw"]

for i in names_to_find:
    print(df[df["NAME"]==i])

            NAME                   EMAIL ID DEPARTMENT
7  SAYANTA DUTTA  sayanta17042002@gmail.com        EIE
          NAME                      EMAIL ID  DEPARTMENT
77  Harsh Shaw  harshshaw.personal@gmail.com  PRODUCTION

In [109]:
names_to_find=["SAYANTA DUTTA","Harsh Shaw"]   # better approach

result=df[df["NAME"].isin(names_to_find)]

result

             NAME                      EMAIL ID  DEPARTMENT
7   SAYANTA DUTTA     sayanta17042002@gmail.com         EIE
77     Harsh Shaw  harshshaw.personal@gmail.com  PRODUCTION

In [120]:
result=df[df["NAME"].isin(['SAYANTA DUTTA'])]

result

            NAME                   EMAIL ID DEPARTMENT
7  SAYANTA DUTTA  sayanta17042002@gmail.com        EIE

In [122]:
result["EMAIL ID"]

7    sayanta17042002@gmail.com
Name: EMAIL ID, dtype: object

In [125]:
df.head()

                  NAME                      EMAIL ID DEPARTMENT
0          Sumit Gupta           sg9471465@gmail.com        EIE
1  Rohondeep Mukherjee  rohandeepmukherjee@gmail.com        EIE
2      ABHINABA SARKAR  abhinabasarkar2002@gmail.com        EIE
3        Raunit Mondal        mondalraunit@gmail.com        EIE
4          Md Abu Toha       mdabutoha2002@gmail.com        EIE

In [138]:
df['EMAIL ID'].unique

<bound method Series.unique of 0              sg9471465@gmail.com
1     rohandeepmukherjee@gmail.com
2     abhinabasarkar2002@gmail.com
3           mondalraunit@gmail.com
4          mdabutoha2002@gmail.com
                  ...
77    harshshaw.personal@gmail.com
78           bitasta2003@gmail.com
79        sahilahamedsk5@gmail.com
80          say10acharya@gmail.com
81           sc031sardar@gmail.com
Name: EMAIL ID, Length: 82, dtype: object>

In [146]:
df['DEPARTMENT'].unique()

array(['EIE', 'ELECTRICAL', 'ELECTRICAL (POWER)', 'ETCE', 'MECHANICAL',
       'METALLURGY', 'PRODUCTION'], dtype=object)

In [149]:
df['DEPARTMENT'].nunique()

7

In [150]:
df.head()

                  NAME                      EMAIL ID DEPARTMENT
0          Sumit Gupta           sg9471465@gmail.com        EIE
1  Rohondeep Mukherjee  rohandeepmukherjee@gmail.com        EIE
2      ABHINABA SARKAR  abhinabasarkar2002@gmail.com        EIE
3        Raunit Mondal        mondalraunit@gmail.com        EIE
4          Md Abu Toha       mdabutoha2002@gmail.com        EIE

In [153]:
max_length_name_size=df['NAME'].str.len().max()

max_length_name_size

20

In [155]:
idx=df['NAME'].str.len().idxmax()

idx

66

In [160]:
max_length_name=df.loc[idx,"NAME"]

max_length_name

'Pranjal Mukhopadhyay'